content.org
#+TODO: TODO(t) | DONE(o)
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: ./
#+title: 麦汁三昧
#+author: mugijiru
#+MACRO: youtube @@html:<div class="org-youtube"><iframe width="600" height="337" src="https://www.youtube.com/embed/$1" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe></div>@@
*** DONE ThinkPad P14s Gen 2 (第11世代インテル) に Manjaro Linux を入れてみている :@Linux:Manjaro:config:skk:
    CLOSED: [2021-10-10 日 19:01]
    :PROPERTIES:
    :EXPORT_FILE_NAME: thinkpad-p14s-gen2-intel-with-manjaro-linux
    :END:
    先月、「えいやっ」で
    [[https://www.lenovo.com/jp/ja/notebooks/thinkpad/p-series/ThinkPad-P14s-Gen-2-14%E2%80%9D-Intel/p/22WSP14P4S2][Lenovo ThinkPad P14s Gen 2 (第11世代インテル)]] を購入した。
    詳細は面倒だから省くけどそれなりの構成にしている。
    なお AMD 版にしなかったのは Linux をちゃんと動かせるか不安だったから。

    で、そのマシンに Manjaro Linux を載せて色々設定している。
    この記事は、そのあたりでどういう設定を書いているかの備忘録的なそれです。

    だってさ〜、絶対忘れるじゃん。だからある程度書いておこうかなって。
    そしてその上でまた後で入れ直ししてそれを見ながらセットアップし直そうかなと。
    そしたら多分その時に見逃していた部分も修正できそうだし。

    というわけでなんか適当につらつらと書いていく。

    ま、Twitter につぶやいていたことを記憶で補完しながら書いている感じだけどね。

    Twitter でのつぶやきだと Twilog で
    - https://twilog.org/mugijiru/date-211003
    - https://twilog.org/mugijiru/date-211009
    あたりに該当する部分。
    まだ2日しか触れてないのよな。うん。

**** Manjaro Linux のインストール
     https://manjaro.org/download/ から Xfce 版のやつをダウンロードして
     Windows PC で DVD に iso ファイルを書き込んで
     それを使ってセットアップしてた。

     その際に
     https://www.mimir.yokohama/useful/0023-installing-manjaro.html
     を参考にした。
     まあパーティションどうしたらいいんだっけ以外は特に悩まなかったけど。

     あとは光学ドライブは大昔に購入した外付けのやつなので
     荷物の奥底から引っ張り出して
     「うわー USB type B のケーブルはどこだ〜!」
     「電源アダプタもねえぞー!」とか一人で騒いでた。
     みんなも機器を仕舞う時はそれに使うケーブルなども一緒に仕舞うようにしような。

     あとパーティションは自動で切ってるけど
     swap 領域はメモリ拡張すると足らないのでなんとかする必要がありそう。
**** Font 設定
     デフォルトの Terminal である xfce4-terminal のフォントが
     何故か文字間が広くて気持ち悪いので Sazanami と IPA フォントを入れた記憶がある。

     history を漁ると

     #+begin_example
     $ pacman -S ttf-sazanami
     $ pacman -S otf-ipafont
     #+end_example

     が出て来たのでとりあえずそうやって入れているっぽい。

     多分 Sazanami を入れてるのは
     https://applecom.blog.jp/archives/31595846.html
     の影響かな。
     日本語環境構築したかったから見ていた記憶がある。

     で、その記事でも後から IPA フォントを入れてるから
     その流れに乗って両方を入れてる感じがある。
***** やってないことだけど補足
      今 Arch Wiki のフォントのページ
      https://wiki.archlinux.jp/index.php/%E3%83%95%E3%82%A9%E3%83%B3%E3%83%88#.E6.97.A5.E6.9C.AC.E8.AA.9E
      を調べてると otf-ipaexfont とか良さそうな雰囲気あるな。

      あとはコーディングする上では ttf-mplus を入れておけば
      とりあず固定幅で使えそうなので一安心できそう。

      ちなみに普段他の環境では Ricty diminished を使っているので
      そこに戻る可能性もあるけど、新しい環境ということで新しいフォントにしてみるのも面白そうなので、
      どうするかはわからない。

**** Terminal(xfce4-terminal) の設定
     上に書いたようにフォントが気に食わなくて別のフォントを入れて
     その後適当に弄ってたけど、
     結局 Monospace 16 に戻った上で文字間は悪くない感じになってしまった。

     あれ、これ最初の設定だよね?? なんで文字間の無駄に広いのが直ったの?? ってなってるけど
     まあ悪くないのでそのままで。

     あとは背景が半透明だったけど
     個人的には半透明な Terminal は、
     カッコいいけど後ろ側が気になってしょうがないので

     - 背景
       - 指定なし(単色を使用する)

     という設定にすることで透明度をゼロにしている。

     あと背景が透けるようにすると処理が重くなるってのもあるよね。

**** Web ブラウザ周りの調整
     Manjaro の Xfce 版には標準で Firefox が入っていた。
     私の普段使いの Web ブラウザも Firefox なので丁度良い。

     まずは言語設定がアメリカ英語だったので日本語に変更。
     英語設定のまま使い続けられるほど強くないのです。

     次にフォントを IPA Pゴシックを基本的に使うように変更。

     そして Firefox Sync で同期をすると
     いつも使ってるアドオンが入っていい感じ。

     多分それ以上は何もしてないかな。
     ここは楽だった。

     なおその後アップデートしたら言語設定が吹っ飛んでてまた設定し直すことになった。

**** 日本語入力(fcitx5-skk)
     日本語入力周りは最近の Linux では fcitx というのを使うらしいので
     それの中の SKK を使うやつを選択した。

     というわけで
     http://neko-mac.blogspot.com/2021/06/archlinuxskk.html
     を参考に設定をした。

     #+begin_example
     $ sudo pacman -S fcitx5-skk
     #+end_example

     あとは fcitx5-configtool も必要なので入れた。

     #+begin_example
     $ sudo pacman -S fcitx5-configtool
     #+end_example

     これを別途入れないと設定ツールが起動できないのだが、
     Not Found 的なエラーが出るわけでもなく単に起動できないだけなので
     何が問題なのか気付きにくかった。
     別途インストールが必要だったが、それに気付くまで2,3時間溶かした気がする。

     そんでもって fcitx5-configtool を

     #+begin_example
     $ fcitx5-configtool
     #+end_example

     で起動して
     右側の Available Input Method から SKK を探して
     左側の Current Input Method に入るようにすると
     Ctrl + SPC で日本語を SKK で入力できるようになる。

     さらに StickyShift を愛用しているのでそのあたりの設定もしている。
     設定ファイルについては先に紹介した記事の内容そのままなので割愛。
     後で GitHub にも設定ファイルを上げるので
     ここに書いてなくても困らないはずだし。

     設定ファイルの準備ができたら
     configtool を再度立ち上げて
     Addons タブ内の Input Method ってところの SKK の設定ボタンをクリックし、
     Rule を Default から先程作った StickyShift に切り替える。

     このあたりの手順も先に紹介した記事にある手順そのままだけど
     まあ人の記事は消えることもあるのでちょっとここにも書かせてもらいました。
     向こうの方が画像キャプチャもあって親切なんだけどね。

     まあともかくこれで日本語でもググることができるようになった。

     あとはよくわからんけど [[https://github.com/mugijiru/dotfiles/blob/ead701cd58dc2596d8fb883641a1d793ccddd3ed/.xprofile#L1-L4][.xprofile]] に

     #+begin_example
     export DefaultIMModule=fcitx
     export GTK_IM_MODULE=fcitx
     export QT_IM_MODULE=fcitx
     export XMODIFIERS="@im=fcitx"
     #+end_example

     とか書いているな。

     [[https://wiki.archlinux.jp/index.php/Fcitx5#.E3.82.A4.E3.83.B3.E3.83.97.E3.83.83.E3.83.88.E3.83.A1.E3.82.BD.E3.83.83.E3.83.89.E3.83.A2.E3.82.B8.E3.83.A5.E3.83.BC.E3.83.AB.E3.81.AE.E7.92.B0.E5.A2.83.E5.A4.89.E6.95.B0.E3.81.AE.E8.A8.AD.E5.AE.9A][ArchWiki の Fcitx5 の記事内にあるインプットメソッドモジュールの環境変数の設定]]
     での記述を見てると、俺が書いてる場所や内容がちょっと違うのでなんか俺が間違えてるかも。

     [[https://wiki.archlinux.jp/index.php/Fcitx#.E3.82.A4.E3.83.B3.E3.83.97.E3.83.83.E3.83.88.E3.83.A1.E3.82.BD.E3.83.83.E3.83.89.E3.83.A2.E3.82.B8.E3.83.A5.E3.83.BC.E3.83.AB.E3.81.AE.E7.92.B0.E5.A2.83.E5.A4.89.E6.95.B0.E3.81.AE.E8.A8.AD.E5.AE.9A][ArchWiki の Fcitx の記事内にあるインプットメソッドモジュールの環境変数の設定]]
     の方の記述に似ているけど、これ ~Fcitx5~ じゃなくて ~Fcitx~ の記事だから多分古いんだよな……。
**** i3wm の導入
     ちゃんとしたタイル型WMを使いたい、というのが Linux にした理由の1つ。
     というわけで i3wm を入れることにした。
     正確には i3-gaps なので fork 版なのだけども。

     実は昔使っていた Awesome にしようかとも思っていたのだけど
     最終更新が一昨年だったのであまり活発じゃないのかな〜と思って
     i3 にすることにした。

     i3wm を使うならコミュニティで提供されている i3 版をインスコした方が良いのではというのもあるんだけど
     気付くのが遅かったのと、
     そっちの設定でミスって起動しなくなった時に Xfce を動かすことでとりあえず乗り切る、みたいなことも考えている。

     でまあそんなわけで i3 周りを入れることにしたので、以下をインストールしてある。

     #+begin_example
     $ sudo pacman -S i3-gaps
     $ sudo pacman -S i3status
     $ sudo pacman -S i3blocks
     $ sudo pacman -S i3lock
     $ sudo pacman -S dmenu
     #+end_example

***** i3-gaps
      i3 の fork 版で i3 より機能が豊富らしい。
      違いがどこにあるかはまだ認識してない。

      Mod キーとの組み合わせで色々な操作ができたりして、操作感は Awesome と似ているかな。
      Awesome を使っていたころも Windows キーを Mod キーとして使っていたので。

      設定ファイルである ~~/.config/i3/config~ は今度 GitHub に上げておこう。

      変更点は、初期設定だと ~jkl;~ を左下上右としていたのが気に食わなかったので
      Vim と同じ hjkl にして、
      その影響で h が従来の目的では使えなくなったので
      水平分割、垂直分割をそれぞれ ~:~ とか ~;~ にしている。
      けど ~-~ ~|~ にした方がわかりやすいかもね

      あとはファイル末尾で exec しているあたりが変更点だが、
      この記事の後の記述でそのあたりについては触れているのでここでは取り上げない。

***** i3status
      ステータスバーに表示されるやつで、デフォルトはこいつみたい。
      デフォルト設定だと文字だらけの表示で正直わかりやすくはないかなと思う。
      一応少しはカスタマイズを試みるつもりだが、すぐ乗り換えそうな気もしている。

***** i3blocks
      なんかあるから入れただけで何も設定してない。
      i3status の代わりに使うと良いらしい。
      i3status のデフォルト表示はあまり気に入ってないのでそのうち使うことになりそう。

***** i3lock
      画面ロック機能を提供してくれるやつ。
      xss-lock と一緒に使うものらしくて
      xss-lock を入れてない状態だとエラーを吐いていたので

      #+begin_example
      $ sudo pacman -S xss-lock
      #+end_example

      としたらロックされるようになった。

      ロック画面は真っ白な画面で
      そこで適当にキーを叩いたりすると真ん中に丸が出て来るというよくわからない感じ。

      真ん中に丸が出てない状態でパスワードを入力して Enter するとロックが解除されるっぽい。
      が、わかりづらいのもあって
      今は指紋認証でロック解除できるようにしてある。
      その詳細は後程。

***** dmenu
      デフォルト設定だと Mod + d で起動するランチャ。
      画面上部のバーに横並びで候補が表示されてそこから絞り込むことができるが
      あまり見易くはない。

      あとは解像度を高めにしているから文字が小さくて困ってるけど
      https://wiki.archlinux.jp/index.php/Dmenu#.E3.83.95.E3.82.A9.E3.83.B3.E3.83.88
      を見るとそこは変更できそう。

      でも [[https://github.com/davatorium/rofi][rofi]] とかに乗り換える方が良いかもしれない。

***** 気になるけどやってないこと
      Alt + Tab での切替を Mac でも Windows でもやってるので
      どうしても手癖でそれをやってしまう。

      というわけでそれを実現できそうな以下の記事が気になる。
      https://scrapbox.io/tamago324vim/i3wm_%E3%81%A7_Alt+Tab_%E3%81%A7%E3%82%A6%E3%82%A3%E3%83%B3%E3%83%89%E3%82%A6%E3%82%92%E5%88%87%E3%82%8A%E6%9B%BF%E3%81%88%E3%82%8B

      が、優先度は低いかなと思って放置中。

**** キーバインドの調整
     とりあえず一旦は CapsLock が a の左隣にあるのが使いにくいし
     まあそもそもそんなに使わない機能なので

     #+begin_example
     $ setxkbmap -option "ctrl:nocaps"
     #+end_example

     で CapsLock を Ctrl に置き換えている。

     そして [[https://github.com/mugijiru/dotfiles/blob/ead701cd58dc2596d8fb883641a1d793ccddd3ed/.xprofile#L6-L7][それを永続化するために .xprofile に書いてる]] ので
     起動直後からもう CapsLock は Ctrl になってる。
     とりあえず最低限これがないとつらい。
