content/posts/thinkpad-p14s-gen2-intel-with-manjaro-linux.md


### やれてないこと {#やれてないこと}

本当にやりたいのは

1.  ESC をバッククォートにして、 Shift 押しながらだとチルダが入力される
2.  CapsLock を Ctrl にする
3.  左 Ctrl を ESC にする

だったりする。

これは今愛用しているキーボード [BAROCCO MD650L](https://archisite.co.jp/products/mistel/md650l-barocco/) のキーの都合で通常のキーボードだとファンクションキーが並ぶ行がまるっとなくてチルダがある部分、つまり1の左隣が Esc になっているのが理由で
Windows, Mac だとそれに合わせてキー配置を上述のようにしているので
Linux でもそういう配置にしたいなという願望。

ESC が左 Ctrl の位置だと押したい時にあまりホームポジションから離れずに左手親指で押せるのも便利。


## キーリピートの調整 {#キーリピートの調整}

デフォルトだとキーを押しっぱなしにした時にリピート入力が始まるのとそのリピート速度が遅くてイラッとしたので

```text
$ xset r rate 200 25
```

としている

r は repeat, rate は比率設定で
200 は delay つまりリピート入力が始まるのがどのぐらい押してからかで最後の 25 は1秒間に何回入力されるかの設定。

なので、キーを押して 0.2 秒経過したら毎秒25回の速度でそのキーが連続入力されるってわけ。

正直毎秒25回は多過ぎるかもとかは思ってるがまあ使ってる間に調整していけばいいかなと思っている。

これもまた [永続化のために .xprofile に書いている](https://github.com/mugijiru/dotfiles/blob/ead701cd58dc2596d8fb883641a1d793ccddd3ed/.xprofile#L9-L10)


## タッチパッドでのカーソル移動の調整 {#タッチパッドでのカーソル移動の調整}

デフォルトだとどうもカーソルの移動が遅くて、触りたいところに移動するのが大変だったのでこれも速度を上げている。

```text
$ xinput set-prop <device_id> <prop_id> 0.5
```

的な感じなのだが永続化はしてなさそう……。あとでやらなきゃ。

ちなみに今は Accel Speed は 0.7 にしている。細かい所にカーソル合わせるのが大変なので難しい。


## 解像度の固定 {#解像度の固定}

ひとまずマシン単体で使う場合に最適化しつつ最低限、いつも使う外部ディスプレイに繋いでる場合にも配置だけはいい感じになるように
[.xprofile に以下のように書いている](https://github.com/mugijiru/dotfiles/blob/ead701cd58dc2596d8fb883641a1d793ccddd3ed/.xprofile#L12-L13)

```text
$ xrandr --output eDP-1 --mode 2880x1620 --right-of DP-2
```

eDP-1 がノートPC自体のディスプレイなのでそいつの解像度を指定しつつ
DP-2 という外部ディスプレイの右側に配置されるように指定している。

DP-2 なのは単にコネクタ的にたまたまそうなってるだけの可能性も高いが。

そうそう。
P14s Gen 2 は USB Type-C のポートが複数あってそこに HDMI ポートもある USB Type-C の USB ハブを繋いでも使えるので仕事用の Macbook Pro で使ってるハブがそのまま使えて便利。


### autorandor {#autorandor}

[autorandr](https://github.com/phillipberndt/autorandr) というのもあってなんか解像度設定を保存したりできるっぽいやつがある。

<https://tech.buty4649.net/entry/2018/12/19/224128> の記事を見るとまだつらそうだけどちゃんと試してみる価値はありそう。


## 指紋認証でログイン、ロック解除、sudo に対応できるようにした {#指紋認証でログイン-ロック解除-sudo-に対応できるようにした}

i3lock でのロック解除画面は「本当にちゃんとキー入力できてるんだっけ？」って不安になったりするし、セットアップ中は sudo を多用するけど、その度にパスワード入れるのもだるいし、っていうかパスワード入力なんて今時じゃないな〜ってことで指紋認証でそのあたりができるようにした。

P14s Gen 2 で搭載されている指紋認証機器は fprintd のサポートに含まれているのでまあ普通にやればできたという感じ。

普通にというのは Arch Wiki に書かれてるのを見ながら設定したらできた。
<https://wiki.archlinux.jp/index.php/Fprint>


### 指紋認証機器が使えるかの確認 {#指紋認証機器が使えるかの確認}

まず

```text
$ lsusb
```

で指紋認証のやつを探して、
<https://fprint.freedesktop.org/supported-devices.html>
の中の USB ID と一致する機器があるか調べたら運良く含まれていて
Synaptics Sensors という Driver が使われるようだった


### fprintd のインストール {#fprintd-のインストール}

というわけでほぼ間違いなく使えるなということで

```text
$ sudo pacman -S fprintd
```

ここで `fprintd` ではなくグループとして定義されている `fprint` を入れようとすると一瞬入りそうな気配になるんだけどこのグループには互いに競合するパッケージが含まれてるから無理やでみたいになるので注意。


### 認証エージェントを動かす。 {#認証エージェントを動かす}

fprintd が入れられたので「じゃあ指紋登録しましょっか」ってことで

```text
$ fprintd-enroll
```

するとなんか知らんが

```text
EnrollStart failed: GDBus.Error:net.reactivated.Fprint.Error.PermissionDenied: Not Authorized: net.reactivated.fprint.device.enroll
```

と怒られる。

調べてるとなんか認証エージェントを動かす必要があるとか書いていた認証エージェントとはなんぞやとなりつつも
<https://wiki.archlinux.jp/index.php/Polkit#.E8.AA.8D.E8.A8.BC.E3.82.A8.E3.83.BC.E3.82.B8.E3.82.A7.E3.83.B3.E3.83.88>
とかを見て「ははーん polkit とかいうのが名前に入ってるやつが必要なんだな」と察して

```text
$ pacman -Ss polkit
```

した時に polkit-gnome がインストール済になっていた。ついでにいうと polkit-qt5 もインストール済だったけど、とりあえず gnome の方でいいやということでそれについてくる agent を自動起動するように i3 の config で

```text
exec --no-startup-id /usr/lib/polkit-gnome/polkit-gnome-authentication-agent-1 &
```

とか書いた。


### 指紋登録 {#指紋登録}

認証エージェントも動いたので再度 `fprintd-enroll` をすると

```text
Using device /net/reactivated/Fprint/Device/0
Enrolling right-index-finger finger.
```

と Terminal に表示された上でポップアッププロンプトが出て来てパスワード入力が求められるので素直にパスワードを入れると。

すると今度はポップアッププロンプトは消えて

```text
Enroll result: enroll-stage-passed
```

とか表示されて、何やら待ってる雰囲気になるので指紋センサーの上に指を乗せたら、同じ行がまた表示されたのでそんじゃあまた指を乗せてってのを数度繰り返すと

```text
Enroll result: enroll-completed
```

と表示されて、指紋登録が完了する。


### 指紋認証の動作確認 {#指紋認証の動作確認}

指紋の登録は完了したので fprint-verify で登録したやつが使えるよねって確認を取る。スキャンした指を乗せるとちゃんと認証できたみたいな雰囲気になる。

```text
$ fprintd-verify mugijiru
Using device /net/reactivated/Fprint/Device/0
Listing enrolled fingers:
- #0: right-index-finger
Verify result: verify-match (done)
```


### pam.d の設定変更 {#pam-dot-d-の設定変更}

その後は [Arch Wiki のログイン設定の説明](https://wiki.archlinux.jp/index.php/Fprint#.E3.83.AD.E3.82.B0.E3.82.A4.E3.83.B3.E8.A8.AD.E5.AE.9A) に従い
`/etc/pam.d/system-local-login` の auth とか書かれている行の上に

```text
auth      sufficient pam_fprintd.so
```

を追加したり同じく `/etc/pam.d/` にある i3lock, lightdm, sudo の各ファイルに同じものを仕込んだ。

以上で sudo の時もロック画面の解除の時もログインする時も指紋センサーに指を置けば OK となった。便利。

ログイン画面は認証 OK になったらパスワード入力欄が非表示になるので、その状態で Enter を叩くか「ログイン」ボタンをクリックする必要があるけどね。まあ起動する WM を選択可能だからそういう手順が必要なんだろう。


## ssh 鍵の生成及び GitHub への登録 {#ssh-鍵の生成及び-github-への登録}

各設定ファイルを GitHub に登録しているのでそこにアクセスしたいよねということで
Manjaro Linux で鍵を生成して GitHub に登録しておいた。

ここらあたりはまあわざわざ細かく書かなくても、再セットアップの時にそんなに僕は困らないだろうなということで、記述はこんなもんにしておく。書いておいたら忘れないよね、ぐらいな感覚。

ファイル名を指定して鍵を作ったのでそれが次の hub コマンド周りに影響がある気はする。


## hub コマンドの設定 {#hub-コマンドの設定}

これも pacman でインスコできたのでそれを使ってる。今時は gh コマンドって気もするが hub コマンドの方が慣れていて……すみません。

で、 hub コマンドを入れて適当なところで `hub clone dotfiles` とかするとユーザー名とパスワードを聞かれて、それを入力すると自動でパーソナルアクセストークンを生成してきてそれを使うように設定されるはずなんだけど、なぜか Not Found しか言わなくて困った。

最終的には PAT を自分で GitHub に作ってさらに自分で `~/.config/hub` という設定ファイルを生成して

```text
---
github.com:
- protocol: https
  user: mugijiru
  oauth_token: MY_PERSONAL_ACCESS_TOKEN
```

みたいな感じで MY\_PERSONAL\_ACCESS\_TOKEN のところに先程生成した PAT を突っ込んでおいたら
`hub clone` が成功するようになった。

というわけで設定ファイルを拾ってきたりできるようになってハッピーになった。


## ssh-agent の自動起動 {#ssh-agent-の自動起動}

設定ファイルを GitHub に上げたりできるようになったのはいいんだけど鍵を作る時にパスフレーズも入れたので
push したり pull したりする度にそれを入力するのがだるいんですわ。

ってことで ssh-agent を使うことにした。

で、どうやら systemd さんに `--user` オプションを渡すことでユーザー権限でそういうものを動かすことができるらしい。便利な世の中じゃ。

というわけで
<https://wiki.archlinux.jp/index.php/SSH%5F%E9%8D%B5#systemd%5F.E3.83.A6.E3.83.BC.E3.82.B6.E3.83.BC.E3.81.A7%5Fssh-agent%5F.E3.82.92.E8.B5.B7.E5.8B.95>
に従い `~/.config/systemd/user/ssh-agent.service` に

```text
[Unit]
Description=SSH key agent

[Service]
Type=forking
Environment=SSH_AUTH_SOCK=%t/ssh-agent.socket
ExecStart=/usr/bin/ssh-agent -a $SSH_AUTH_SOCK

[Install]
WantedBy=default.target
```

という内容のファイルを置いて

```text
$ systemctl --user enable ssh-agent
```

とかすることでログイン時に ssh-agent が動くようにした。

さらに
<https://github.com/mugijiru/dotfiles/blob/ead701cd58dc2596d8fb883641a1d793ccddd3ed/.zshrc#L157-L160>
に書いてるように .zshrc に末尾に

```text
# use ssh agent with systemd
if [ -e "$XDG_RUNTIME_DIR/ssh-agent.socket" ]; then
  export SSH_AUTH_SOCK="$XDG_RUNTIME_DIR/ssh-agent.socket"
fi
```

と書くことで自動起動した ssh-agent に繋がるようになった。
<https://github.com/mugijiru/dotfiles/pull/11>

その状態で

```text
$ ssh-add hoge_key
```

みたいにすることで鍵を登録できるのでそのセッションでは ssh 鍵のパスフレーズを入力しないで済むようになって便利になった。


## zsh の設定 {#zsh-の設定}

mugijiru/dotfiles を clone してきてあるので

```text
$ ln -s /path/to/dotfiles/.zshrc ~/.zshrc
```

するだけで OK


## fzf の設定 {#fzf-の設定}

最近 fzf を使いだすようになったので
Manjaro でもそれを使いたいということで

```text
$ sudo pacman -S fzf
```

でインストール。

さらに dotfiles に `.fzf.zsh` も置いてるので

```text
$ ln -s /path/to/dotfiles/.fzf.zsh ~/.fzf.zsh
```

したら OK

まあ本当はセットアップの時はその記述がちょっと環境と合ってなくて
`/usr/share` にファイルがある場合はそれを読むように変更している。
<https://github.com/mugijiru/dotfiles/pull/8>

まあもうこの調整を push してあるので次回はハマらないはずだ。


## その他 {#その他}

-   w3m はあると便利なのでとりあえず入れている
-   tmux も入れておいた
    -   tmuxinator は入れてないし tmux の設定ファイルも反映してない
