content/posts/thinkpad-p14s-gen2-intel-with-manjaro-linux.md


## 対応できてないこと {#対応できてないこと}

と、それなりに時間をかけていくつか設定してきたけどまだまだやれてないことはある。

以下はぱっと思い付く、やりたいけどやれてないこと。

-   ログイン画面の解像度変更はうまくいってない
    -   解像度が高過ぎて文字が米粒みたいでちょっと困ってる。
-   音が出ないっぽい
    -   まあ音なんかそんなに必要じゃないので後回しにしている。
    -   Xfce に戻したら鳴りそうな気もしている
-   Emacs 周りの調整
    -   大変そうなので後回し中
-   起動する Terminal 差し替え
    -   今はまだ xfce4-terminal を動かしているが urxvt にした方が軽くて良さそうだなと思っている

ここにリストアップした以外にも文章中にもそういうのが書かれてるしぱっとは思い付いてない何かもありそうなのでまだまだ設定には時間がかかりそう。楽しいねえ。
